package demo.java;

/**
 * Created by dd  on  2018/9/11.
 * 题目描述
 * 在n个元素的数组中，找到差值为k的除重后的数字对
 * 输入描述
 * 第一行：n和k，n表示数字的个数，k表示差值
 * 第二行：n个整数
 * 输入样例
 *          输入：
 *                   5 2
 *                   1 5 3 4 2
 *          输出：
 *                   3
 *          说明：
 *                   （1，3），（5，3），（4，2）
 *          输入：
 *                   6 2
 *                   1 5 3 3 4 2
 *          输出：
 *                   3
 *          说明：
 *                   （1，3），（5，3），（4，2）
 *          输入：
 *                   4 0
 *                   1 1 1 1
 *          输出：
 *                   1
 *          说明：
 *                   （1，1）
 */
public class Test34 {
}
